In [1]:
import pandas as pd

In [3]:
stations_path = "Resources/Weather Station Locations.csv"
weather_data_path = "Resources/Summary of Weather.csv"

stations = pd.read_csv(stations_path)
weather_data = pd.read_csv(weather_data_path)

weather_station_merged_df = pd.merge(stations, weather_data, left_on="WBAN", right_on="STA", how='outer')
weather_station_merged_df

,WBAN,NAME,STATE/COUNTRY ID,LAT,LON,ELEV,Latitude,Longitude,STA,Date,...,FB,FTI,ITH,PGT,TSHDSBRSGF,SD3,RHX,RHN,RVG,WTE
0,33013,AIN EL,AL,3623N,00637E,611,36.383333,6.65,33013.0,1943-3-11,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,33013,AIN EL,AL,3623N,00637E,611,36.383333,6.65,33013.0,1943-3-12,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,33013,AIN EL,AL,3623N,00637E,611,36.383333,6.65,33013.0,1943-3-13,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,33013,AIN EL,AL,3623N,00637E,611,36.383333,6.65,33013.0,1943-3-14,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,33013,AIN EL,AL,3623N,00637E,611,36.383333,6.65,33013.0,1943-3-15,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119037,15027,WARRINGTON,UK,5323N,00239W,27,53.383333,-2.05,15027.0,1945-10-18,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119038,15027,WARRINGTON,UK,5323N,00239W,27,53.383333,-2.05,15027.0,1945-10-19,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119039,15027,WARRINGTON,UK,5323N,00239W,27,53.383333,-2.05,15027.0,1945-10-20,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119040,15027,WARRINGTON,UK,5323N,00239W,27,53.383333,-2.05,15027.0,1945-10-21,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119041,15027,WARRINGTON,UK,5323N,00239W,27,53.383333,-2.05,15027.0,1945-10-22,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
data_station_df = weather_station_merged_df.drop(columns=["LAT","LON","STA","Precip","WindGustSpd","MaxTemp","MinTemp","MeanTemp","Snowfall","PoorWeather","YR","MO","DA","SND","FT","FB","FTI","ITH","PGT","TSHDSBRSGF","SD3", "RHX","RHN","RVG","WTE"])
data_station_df

,WBAN,NAME,STATE/COUNTRY ID,ELEV,Latitude,Longitude,Date,PRCP,DR,SPD,MAX,MIN,MEA,SNF
0,33013,AIN EL,AL,611,36.383333,6.65,1943-3-11,NaN,NaN,NaN,60.0,37.0,48.0,0
1,33013,AIN EL,AL,611,36.383333,6.65,1943-3-12,0,NaN,NaN,55.0,40.0,48.0,0
2,33013,AIN EL,AL,611,36.383333,6.65,1943-3-13,NaN,NaN,NaN,63.0,37.0,50.0,0
3,33013,AIN EL,AL,611,36.383333,6.65,1943-3-14,NaN,NaN,NaN,50.0,45.0,48.0,0
4,33013,AIN EL,AL,611,36.383333,6.65,1943-3-15,0,NaN,NaN,58.0,42.0,50.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119037,15027,WARRINGTON,UK,27,53.383333,-2.05,1945-10-18,0,NaN,NaN,54.0,41.0,47.0,0
119038,15027,WARRINGTON,UK,27,53.383333,-2.05,1945-10-19,0,NaN,NaN,60.0,49.0,54.0,0
119039,15027,WARRINGTON,UK,27,53.383333,-2.05,1945-10-20,NaN,NaN,NaN,60.0,45.0,52.0,0
119040,15027,WARRINGTON,UK,27,53.383333,-2.05,1945-10-21,NaN,NaN,NaN,63.0,54.0,58.0,0
119041,15027,WARRINGTON,UK,27,53.383333,-2.05,1945-10-22,NaN,NaN,NaN,58.0,48.0,53.0,0

In [15]:
data_station_df.to_csv('Resources/weather_combined.csv')